In [8]:
import duckdb

conn = duckdb.connect(database='madang.db')
conn.sql("create table Customer as select * from 'Customer_madang.csv'")
conn.sql("create table Book as select * from 'Book_madang.csv'")
conn.sql("create table Orders as select * from 'Orders_madang.csv'")
conn.close()

CatalogException: Catalog Error: Table with name "Customer" already exists!

In [6]:
import duckdb
conn = duckdb.connect(database='madang.db')

In [7]:
conn.sql("select * from Customer")

┌────────┬─────────┬─────────────────┬───────────────┐
│ custid │  name   │     address     │     phone     │
│ int64  │ varchar │     varchar     │    varchar    │
├────────┼─────────┼─────────────────┼───────────────┤
│      1 │ 박지성  │ 영국 맨체스타   │ 000-5000-0001 │
│      2 │ 김연아  │ 대한민국 서울   │ 000-6000-0001 │
│      3 │ 장미란  │ 대한민국 강원도 │ 000-7000-0001 │
│      4 │ 추신수  │ 미국 클리블랜드 │ 000-8000-0001 │
│      5 │ 박세리  │ 대한민국 대전   │ NULL          │
└────────┴─────────┴─────────────────┴───────────────┘

In [8]:
def query(sql, retunrType='df'):
       if retunrType == 'df':
              return conn.execute(sql).df()
       else:
              return conn.execute(sql).fetchall()

#query("select * from Book", "df")
query("select * from Book", "list")

[(1, '축구의 역사', '굿스포츠', 7000),
 (2, '축구아는 여자', '나무수', 13000),
 (3, '축구의 이해', '대한미디어', 22000),
 (4, '골프 바이블', '대한미디어', 35000),
 (5, '피겨 교본', '굿스포츠', 8000),
 (6, '역도 단계별기술', '굿스포츠', 6000),
 (7, '야구의 추억', '이상미디어', 20000),
 (8, '야구를 부탁해', '이상미디어', 13000),
 (9, '올림픽 이야기', '삼성당', 7500),
 (10, 'Olympic Champions', 'Pearson', 13000)]

In [9]:
conn.execute("select * from Orders").fetchall()

[(1, 1, 1, 6000, datetime.date(2014, 7, 1)),
 (2, 1, 3, 21000, datetime.date(2014, 7, 3)),
 (3, 2, 5, 8000, datetime.date(2014, 7, 3)),
 (4, 3, 6, 6000, datetime.date(2014, 7, 4)),
 (5, 4, 7, 20000, datetime.date(2014, 7, 5)),
 (6, 1, 2, 12000, datetime.date(2014, 7, 7)),
 (7, 4, 8, 13000, datetime.date(2014, 7, 7)),
 (8, 3, 10, 12000, datetime.date(2014, 7, 8)),
 (9, 2, 10, 7000, datetime.date(2014, 7, 9)),
 (10, 3, 8, 13000, datetime.date(2014, 7, 10))]

In [10]:
conn.sql("select * from Orders")

┌─────────┬────────┬────────┬───────────┬────────────┐
│ orderid │ custid │ bookid │ saleprice │ orderdate  │
│  int64  │ int64  │ int64  │   int64   │    date    │
├─────────┼────────┼────────┼───────────┼────────────┤
│       1 │      1 │      1 │      6000 │ 2014-07-01 │
│       2 │      1 │      3 │     21000 │ 2014-07-03 │
│       3 │      2 │      5 │      8000 │ 2014-07-03 │
│       4 │      3 │      6 │      6000 │ 2014-07-04 │
│       5 │      4 │      7 │     20000 │ 2014-07-05 │
│       6 │      1 │      2 │     12000 │ 2014-07-07 │
│       7 │      4 │      8 │     13000 │ 2014-07-07 │
│       8 │      3 │     10 │     12000 │ 2014-07-08 │
│       9 │      2 │     10 │      7000 │ 2014-07-09 │
│      10 │      3 │      8 │     13000 │ 2014-07-10 │
├─────────┴────────┴────────┴───────────┴────────────┤
│ 10 rows                                  5 columns │
└────────────────────────────────────────────────────┘

In [11]:
query("select * from Customer c, Orders o where c.custid = o.custid")

,custid,name,address,phone,orderid,custid_1,bookid,saleprice,orderdate
0,1,박지성,영국 맨체스타,000-5000-0001,1,1,1,6000,2014-07-01
1,1,박지성,영국 맨체스타,000-5000-0001,2,1,3,21000,2014-07-03
2,2,김연아,대한민국 서울,000-6000-0001,3,2,5,8000,2014-07-03
3,3,장미란,대한민국 강원도,000-7000-0001,4,3,6,6000,2014-07-04
4,4,추신수,미국 클리블랜드,000-8000-0001,5,4,7,20000,2014-07-05
5,1,박지성,영국 맨체스타,000-5000-0001,6,1,2,12000,2014-07-07
6,4,추신수,미국 클리블랜드,000-8000-0001,7,4,8,13000,2014-07-07
7,3,장미란,대한민국 강원도,000-7000-0001,8,3,10,12000,2014-07-08
8,2,김연아,대한민국 서울,000-6000-0001,9,2,10,7000,2014-07-09
9,3,장미란,대한민국 강원도,000-7000-0001,10,3,8,13000,2014-07-10

In [9]:
import duckdb

# 1. DB 연결 (쓰기 모드)
conn = duckdb.connect(database='madang.db', read_only=False)

# 2. 데이터 입력 (query 함수 대신 conn.sql 사용)
conn.sql("insert into Customer values (6, '박준형', '경기도 과천시', '010-1234-5678')")

# 3. 잘 들어갔는지 확인
print(conn.sql("SELECT * FROM Customer WHERE name='박준형'").df())

# 4. 다 썼으면 연결 종료 (중요!)
conn.close()

   custid name  address          phone
0       6  박준형  경기도 과천시  010-1234-5678